Tekla.Structures.Drawing.InsidePartAlongPartPlacingType
The InsidePartAlongPartPlacingType class defines a placing type that
places the object using the base line placing.
The base line used is in the middle of the part, aligned with the part.

Tekla.Structures.Drawing.InsidePartAlongPartPlacingType.#ctor
Creates a new inside part along part placing type instance.